🚀&nbsp; env0 had composed a PR Plan for environment [Demo-90557](https://app.env0.com/p/bcbaf700-9894-402b-a47f-36b224da3faf/environments/ef3c9a6c-9c83-43a1-8622-0303e9079a0d):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```

<details>

<summary>Plan Details</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # azurerm_virtual_machine.main must be replaced
-/+ resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/tfvmex-resources/providers/Microsoft.Compute/virtualMachines/tfvmex-vm" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "tfvmex-vm"
        tags                             = {
            "env0_environment_id" = "ef3c9a6c-9c83-43a1-8622-0303e9079a0d"
            "env0_project_id"     = "bcbaf700-9894-402b-a47f-36b224da3faf"
        }
      - zones                            = [] -> null
        # (6 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      - os_profile {
          - admin_username = "testadmin" -> null
          - computer_name  = "hostname" -> null
        }
      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "testadmin"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }


      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      - storage_image_reference { # forces replacement
          - offer     = "UbuntuServer" -> null
          - publisher = "Canonical" -> null
          - sku       = "16.04-LTS" -> null
          - version   = "latest" -> null
        }
      + storage_image_reference { # forces replacement
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      ~ storage_os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/ddc30188-075a-470d-a6ca-05a1987c51a3/resourceGroups/tfvmex-resources/providers/Microsoft.Compute/disks/myosdisk1" -> (known after apply)
            name                      = "myosdisk1"
          ~ os_type                   = "Linux" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>

  ```
Monthly cost change for smsilva/terraform/azure/virtual-machine/.tf-plan
Amount:  $0.00 ($51.10 -> $51.10)
Percent: 0%
```

<details>

<summary>Cost Estimation Details</summary>

```
Project: smsilva/terraform/azure/virtual-machine/.tf-plan

Monthly cost change for smsilva/terraform/azure/virtual-machine/.tf-plan
Amount:  $0.00 ($51.10 -> $51.10)
Percent: 0%

----------------------------------
Key: ~ changed, + added, - removed

No changes detected. Run infracost breakdown to see the full breakdown.
```
</details>

  
[Full Plan Logs on env0](https://app.env0.com/p/bcbaf700-9894-402b-a47f-36b224da3faf/environments/ef3c9a6c-9c83-43a1-8622-0303e9079a0d/deployments/faf31b91-b57e-4773-aa82-201cb114afb0)